[
    {
      "concept": "Price-to-Earnings (P/E) Ratio",
      "keywords": ["p/e", "pe ratio", "price-to-earnings", "valuation", "multiple"],
      "summary": "The P/E ratio is a valuation metric that compares a company's current share price to its per-share earnings.",
      "explanation": "A high P/E ratio could mean that a stock's price is high relative to earnings and possibly overvalued. Conversely, a low P/E might indicate that the current stock price is low relative to earnings and possibly undervalued. It is most useful for comparing companies within the same industry.",
      "type": "Valuation Metric"
    },
    {
      "concept": "Sharpe Ratio",
      "keywords": ["sharpe ratio", "risk-adjusted return", "risk", "volatility"],
      "summary": "The Sharpe Ratio measures the performance of an investment compared to a risk-free asset, after adjusting for its risk.",
      "explanation": "It is calculated as (Return of Portfolio - Risk-Free Rate) / Standard Deviation of the Portfolio's Excess Return. A higher Sharpe Ratio indicates a better risk-adjusted return. A ratio > 2 is considered strong:contentReference[oaicite:0]{index=0}.",
      "type": "Risk Metric"
    },
    {
      "concept": "Insider Transactions",
      "keywords": ["insider trading", "insider transactions", "ceo buying", "executive selling"],
      "summary": "Insider transactions are the buying or selling of a publicly traded company's stock by insiders (directors, officers, major shareholders).",
      "explanation": "Insider 'buys' are often viewed as a bullish signal as company insiders are optimistic about the stock. Insider 'sells' can occur for many reasons (diversification, personal finance) and are not always a bearish signal.",
      "type": "Sentiment Indicator"
    },
    {
      "concept": "Beta (β)",
      "keywords": ["beta", "volatility", "market risk", "systematic risk"],
      "summary": "Beta measures a stock's volatility relative to the overall market.",
      "explanation": "A stock with a beta greater than 1.0 is more volatile than the market; less than 1.0 is less volatile. A beta of 0.8 implies the stock is expected to be 20% less volatile than the market.",
      "type": "Risk Metric"
    },
    {
      "concept": "Yield Curve Inversion",
      "keywords": ["yield curve", "inversion", "inverted yield curve", "recession indicator"],
      "summary": "A yield curve inversion occurs when long-term bond yields fall below short-term yields for bonds of the same credit quality.",
      "explanation": "This condition is widely regarded as a predictor of economic recessions because it signals investors expect weaker growth and lower interest rates in the future.",
      "type": "Macroeconomic Indicator"
    },
    {
      "concept": "Sortino Ratio",
      "keywords": ["sortino ratio", "downside risk", "risk-adjusted return"],
      "summary": "The Sortino Ratio measures risk-adjusted return focusing only on downside volatility.",
      "explanation": "It is calculated as (Return - Risk-Free Rate) / Downside Deviation. Unlike the Sharpe Ratio, it penalizes only harmful volatility. Ratios above 2 are preferred for better downside risk-adjusted returns:contentReference[oaicite:1]{index=1}.",
      "type": "Risk Metric"
    },
    {
      "concept": "Calmar Ratio",
      "keywords": ["calmar ratio", "drawdown", "risk-adjusted return"],
      "summary": "The Calmar Ratio compares a strategy's annualized return to its maximum drawdown.",
      "explanation": "Calculated as Annual Return / Maximum Drawdown. Ratios above 2 indicate a good balance of returns and downside risk:contentReference[oaicite:2]{index=2}.",
      "type": "Risk Metric"
    },
    {
      "concept": "Profit Factor",
      "keywords": ["profit factor", "trading performance"],
      "summary": "Profit Factor is the ratio of gross profits to gross losses in a trading strategy.",
      "explanation": "A Profit Factor above 1.75 suggests that a strategy is generating strong returns for each unit of loss incurred:contentReference[oaicite:3]{index=3}.",
      "type": "Performance Metric"
    },
    {
      "concept": "Maximum Drawdown (MDD)",
      "keywords": ["maximum drawdown", "mdd", "peak-to-trough"],
      "summary": "Maximum drawdown measures the largest peak-to-trough decline in an investment's value.",
      "explanation": "Lower drawdowns (<15%) indicate better capital preservation, whereas drawdowns above 25% require higher risk tolerance:contentReference[oaicite:4]{index=4}.",
      "type": "Risk Metric"
    },
    {
      "concept": "Mean-Variance Optimization",
      "keywords": ["mean-variance", "modern portfolio theory", "optimization", "efficient frontier"],
      "summary": "A portfolio construction technique that selects asset weights to minimize risk for a given expected return.",
      "explanation": "Developed by Harry Markowitz, mean-variance optimization uses expected returns, standard deviations and the covariance matrix to compute weights that minimize portfolio volatility for a target return:contentReference[oaicite:5]{index=5}.",
      "type": "Portfolio Construction"
    },
    {
      "concept": "Momentum Strategy",
      "keywords": ["momentum", "trend following", "moving average"],
      "summary": "A trading strategy that buys assets with upward price momentum and sells those with downward momentum.",
      "explanation": "Often implemented using moving averages (e.g., 50-day MA). When the price is above its moving average, the strategy goes long; when below, it exits or shorts.",
      "type": "Trading Strategy"
    },
    {
      "concept": "Mean Reversion Strategy",
      "keywords": ["mean reversion", "bollinger bands", "contrarian"],
      "summary": "A strategy based on the idea that prices will revert to their long-term mean.",
      "explanation": "Bollinger Bands are often used: buy when price falls below the lower band, sell when it rises above the upper band. The strategy assumes extremes are temporary and prices will revert.",
      "type": "Trading Strategy"
    }
  ]
      